[
    {
        "key": 0,
        "author": "Jaymie Levan",
        "quote": "I moved from San Diego, CA to Bath, Maine. I was shipping most of my items in shipping pods through Big Box company. I was looking for a local mover to move my items from the shipping facility where my boxes would be delivered near Portland to my home in Bath. The box company tried to help us find someone, but we only got two outrageous quotes. So I started google local movers and Local Muscle Movers camp up along with about a dozen or so others. Out of all of the inquiries I sent, Local Muscle Movers responded promptly and worked with me on getting an electronic quote over. The wrench in my situation is that I did not know exactly when my boxes would arrive at the shipping facility. The Box company said 10-14 business days. Long story short because of the ineptitude of the box company we had to reschedule Local Muscle a few times. They were flexible, always responsive, and made our move work. Not only that, they were fast, efficient and took pictures and noted damaged items as they unloaded the boxes. They were extremely professional with every hiccup that happened with our move. I cannot recommend them enough."
    },
    {
        "key": 1,
        "author": "Tobin Moore",
        "quote": "I'm so glad Local Muscle was recommended to me when I was preparing for my move. It was a breeze to book them and all my many questions were answered by the folks in the office. On moving day Chris, Max, Charlie, and Soren were all simply wonderful. They treated my belongings with care and were friendly, considerate, and efficient. Moving is always so stressful but these guys made it a very pleasant experience! Local Muscle should be proud to have them.\""
    },
    {
        "key": 2,
        "author": "Melanie Dorn",
        "quote": "Highly recommend Local Muscle. The movers showed up on time, were very friendly while being efficient. They dealt with the parking permits, which was a relief since both locations were tough parking situations. They asked me where I wanted the furniture and take really good care of antique furniture that I care a lot about. Love that it is a local company involved in the arts community too! I was slightly hesitant because it was in the high/mid-range of price quotes I received, but I went with them because of the good reviews. Really glad I did because the price ended up being the lowest estimated cost -- over all great experience so I wanted to make sure I left a review! They were also very COVID-conscious and wore masks the whole time, which I appreciated!"
    },
    {
        "key": 3,
        "author": "Anonymous Yelp Review",
        "quote": "GREAT! these guys know what they are doing and do it very, very well. I thought the move would take most of the day but they packed up our house and delivered all contents without incident. Not only would I hire them again, but I would gladly tell all my friends about how great they are. I don't want to over again....but if I did, these would be the only movers I would use."
    },
    {
        "key": 4,
        "author": "Anonymous Yelp Review",
        "quote": "Had truck packed within one hour and delivered contents after a two hour ride to new location. All contents arrived safe and sound. Pat and Zack, great job👍"
    },
    {
        "key": 5,
        "author": "Erin Bertoni",
        "quote": "Highly recommend Local Muscle for all your moving needs! They were fantastic. My one bedroom with some heavy boxes was loaded up in under an hour and unloaded up 3 flights of stairs in just about the same time. Dan and the crew were personable, helpful, and covid compliant with masks on the entire time. Very happy I went with them! :)"
    },
    {
        "key": 6,
        "author": "Elizabeth Whitmore",
        "quote": "The folks at Local Muscle will give you the best service at the best price, hands down. I got quotes from a few local moving companies and found LM's prices to be similar or less than their competitors. Dan was professional and helpful through the planning process, and the two people that did the actual moving were courteous and careful with my items. Start to finish it was a great experience."
    },
    {
        "key": 7,
        "author": "Marijana Mitrovic",
        "quote": "Local muscle helped us move our stuff from 1 home and storage unit to a new home and we had a great experience! They were responsive, punctual, worked very quickly, and did an overall great job. Highly recommend."
    },
    {
        "key": 8,
        "author": "Michael S",
        "quote": "I highly recommend Local Muscle Movers for your moving needs. Dan was great to deal with to provide us a quote for a move that happened with an extremely short lead time. I called on Monday to get a quote to move from our storage facility and we moved on Saturday of the same week. Not only were they fast and courteous but they very professional to work with. Chris & Ben were the movers that arrived within the arrival time window and were very easy to work with. They even moved a couple of larger items into our basement after we moved into our house and realized that the pieces were not right in the space that they were originally intended. Without hesitation they moved the pieces for us. I’m also very happy with the care that they took in carefully moving our belongings into a newly constructed home. They are now the first company that I will call if I need to move anything!"
    },
    {
        "key": 9,
        "author": "Alix Olcott",
        "quote": "Quick to respond with our quote, reasonably priced and the guys stayed busy the whole time they were on site. Thank you for taking the stress away from our move!"
    },
    {
        "key": 10,
        "author": "Abby Jordan",
        "quote": "I have used local muscle now 3 times for various types of moves and each time I am impressed with the speed and professionalism of the crew. I will continue to recommend this company to anyone who is moving because once you use these guys you’ll never want to try to get a couch down a set of stairs yourself again!"
    },
    {
        "key": 11,
        "author": "Cera Catron",
        "quote": "I moved last month, and hired Local Muscle to help with all of the largest items. The estimate form is very thorough, they made sure to understand exactly what needed to be moved and do most planning before they arrived. They arrived on time with all of the information on file and made a plan with myself and my partner about how to proceed. The movers were polite, efficient, careful, and personable. They safely moved all of the items on my list, plus a few extra in less than the original estimated time.  I was extremely pleased with the service and do recommend them for anyone moving near Portland."
    },
    {
        "key": 12,
        "author": "Bill Heisel",
        "quote": "From applying on line for an estimate to when the U-Box doors were closed the company was top notch!! Working with Dan from the start then Andrew and Dylan on site it was money well spent and a huge stress free and time saving experience.  I highly recommend this company.  Five stars man, great job and thank you!!"
    },
    {
        "key": 13,
        "author": "Nicholas Herrick",
        "quote": "These guys are great! They moved my three bedroom house across Maine with no issues. Super punctual, great communication and they went above and beyond moving what we had and making sure it was secured and safe. I will recommend them to anyone who asks, they are heads and shoulders above the competition. Thank you again!"
    },
    {
        "key": 14,
        "author": "Cera Catron",
        "quote": "I moved last month, and hired Local Muscle to help with all of the largest items. The estimate form is very thorough, they made sure to understand exactly what needed to be moved and do most planning before they arrived. They arrived on time with all of the information on file and made a plan with myself and my partner about how to proceed. The movers were polite, efficient, careful, and personable. They safely moved all of the items on my list, plus a few extra in less than the original estimated time.  I was extremely pleased with the service and do recommend them for anyone moving near Portland."
    },
    {
        "key": 15,
        "author": "Terry Judkins",
        "quote": "Jake and Tim were top-notch. Very careful with our belongings. No scratches in tight spots, of which there were plenty. They were both extremely knowledgeable about the company and kept us informed regarding their arrival time as the date/time neared. Overall a very smooth move thanks to this team. Would highly recommend Local Muscle Movers!"
    },
    {
        "key": 16,
        "author": "Merril Abramson",
        "quote": "They are a five star moving company.  Extremely courteous, professional, prompt, respectful.  From the moment I left a message, i was treated with excellent service. I received a call within 10 minutes.  He discussed my job and asked questions that helped him to understand exactly what  I needed help with.  He said he would call back with an estimate and hourly charge.  Again, promptness--he call back within 10 minutes.  He arranged for 3 Five Star Workers!  They were completely on time.  I have never seen movers be so careful and respectful of my belongings.  They far exceeded my expectations.  I highly recommend using them."
    },
    {
        "key": 17,
        "author": "cl darcy",
        "quote": "Trustworthy. Affordable. Friendly. Convenient. Local Muscle is by FAR the best moving company in the Northeast. Portland and Burlington are lucky cities. I used Local Muscle when I moved and they had me out of one place and into another in ONE HOUR. They were very careful with all of my belongings and we're super friendly and fast. They used blankets to cover everything that could be damaged and everything arrived unscathed! I would hire them again in a heartbeat and recommend them to EVERYONE."
    },
    {
        "key": 18,
        "author": "Jennifer Nemi Johnson",
        "quote": "Local Muscle was extremely professional, efficient and easy going.  From the initial estimate to final delivery of my stuff I never worried about a thing.  I shopped around for movers for the best price -- Local Muscle had the best price and the estimate was straight forward. On move day they worked quickly and efficiently.  If I ever move again I will definitely hire them!"
    },
    {
        "key": 19,
        "author": "Sarah Wintle Alexander",
        "quote": "This is a great company, across the board.  I had a lot of questions up front that they answered happily.  The guys who moved my things were professional and relatively quick.  I would definitely recommend this company to anyone looking for a local, affordable company to help with a move.  You won't be sorry you spent the money on these guys!  Thanks Local Muscle!"
    },
    {
        "key": 20,
        "author": "Fleming Serra",
        "quote": "Ben, Drew and Royce were amazing.  Their day was challenging and we were the last move and they still took their time and moved everything we needed with care.  We would recommend Local Musle to anyone that is in need of moving.  Great group of guys.  Maine or Vermont!"
    },
    {
        "key": 21,
        "author": "Linda Moons",
        "quote": "Great experience. Punctual, friendly, efficient, affordable, no  hidden agenda. Would highly recommend"
    },
    {
        "key": 22,
        "author": "Carla Chandler",
        "quote": "The team at Local Muscle made two moves in our family in the past ten months go smooth, smooth, smooth. We hired them for the load, move and unload, not for packing.\nThey were professional from start to finish - efficient by phone, quote process, follow-up, reminders, email receipts, booking appointment, move day efficiency and professionalism, handing items with care and a friendly team on actual move day.\nAfter the first move, there was no question who we would call for the second move and they did not disappoint.\nI highly recommend the team at Local Muscle and my entire family completely agrees!"
    },
    {
        "key": 23,
        "author": "Subhadeep Barman",
        "quote": "Patrick and Adam did a fantastic job moving my belongings to my new apartment. They moved items around sharp corners and down tight stairs. I would not hesitate to recommend them to a friend or family. I actually was referred to them by a good friend of mine who also had an excellent moving experience with them. Thanks guys! You rock!"
    },
    {
        "key": 24,
        "author": "Kate Saunders",
        "quote": "These guys are awesome! We need 10 stars. They helped us move for the first time today and they were on time, professional, courteous, reasonable, and did a great job moving our things. We will recommend them to everyone! Thanks guys!!"
    },
    {
        "key": 25,
        "author": "Sarah Witte",
        "quote": "YOU GUYS! Everything went so well. Huge thank you to Mike C, Dan S, Ben T, and Carl E for a really great job on short notice. It wasn't easy but you brought such a great attitude and solved every little problem calmly. Awesome TLC. I have already recommended you to, well, everyone else I've seen since this afternoon. THANK YOU AGAIN! Local Muscle is the best."
    },
    {
        "key": 26,
        "author": "Christine Palmer",
        "quote": "We were amazed by this crew! Jake and Julia not only showed up on time, were courteous and professional, they also performed magic in getting all of our oversized pieces up or down narrow staircases. They were toting boxes of books like they were feathers. On top of it all, the price for services was incredibly reasonable -- and they never once made fun of the crap we moved (rocks, anyone?). This outfit came recommended and I will add our names to the list of those doing the recommending. Thank you, thank you, Local Muscle!"
    },
    {
        "key": 27,
        "author": "Ian Anders",
        "quote": "By a wide margin the best branch of the best moving company in New England. The level of care, and customer service they provide is unmatched. They went above and beyond in every aspect of our move. Also they were handsome."
    },
    {
        "key": 28,
        "author": "High Family (The Highs)",
        "quote": "local muscle was fantastic!  they were easy to deal with when making the arrangements, reliable and fabulous movers.   Peter and Jeff moved us so quickly and thoughtfully, taking great care with our furniture and were innovative with large size things moving through small spaces.  We will use them again without question!  Remarkably reasonably priced with good equipment and even better service, they are a great team!"
    },
    {
        "key": 29,
        "author": "Wil Thieme",
        "quote": "These guys took on a job that nobody else would even attempt. Not only did they accomplish it, they only took 20minutes.\nThey were also very personable and took measurements to ensure there was enough room."
    },
    {
        "key": 30,
        "author": "Alan Mooiman",
        "quote": "ZP and KP unloaded our POD that was parked on the street. They were running early and called because their previous job ended early and we told them to come on over. They were efficient, careful, and friendly. They did in 2 hours what probably would have taken my wife and me 6 to 8 hours. I would use them again, except I don't plan on moving again anytime in the foreseeable future. But you should hire them!"
    },
    {
        "key": 31,
        "author": "Lee Van Dyke",
        "quote": "We moved to our home in Portland just before Thanksgiving weekend.  We scheduled our PODS arrivals in conjunction with our Local muscle guys, and they were both on time, but worked with efficiency and intelligence.  They were a joy to have around, if joy can be had when moving one's life possessions.  What I mean to say is they were courteous, careful, and cheerful about the day.  Great workers.  I'd recommend them absolutely.  And you know i\"m telling you the truth, because I'm determined to not move again myself, any time soon.  i.e. I have no motive other than to assist anyone considering hiring them."
    },
    {
        "key": 32,
        "author": "Jamie Belanger",
        "quote": "From the moment I asked for a quote until the move was done, every step of the process was impressive. Over email and phone, everyone was polite and personable. The day of the move, Cliff and Soren showed up exactly on time, finished early, and didn't damage a single thing. Fast, accurate, and best of all safe. I hate moving, but next time I must, I know who to call."
    },
    {
        "key": 33,
        "author": "Dave Norman",
        "quote": "The most professional, diligent, and courteous movers I've ever worked with. They overcame some big obstacles with our oversize belongings, they arrived perfectly on time, had great communication throughout, and they earned my explicit trust--very important to me when having people load all my worldly belongings, some of them loose, into their van. These folks are great. We used 'em twice, and are about to use them a third time!"
    },
    {
        "key": 34,
        "author": "Caitlyn Hewson",
        "quote": "Local Muscle was incredible. Professional, efficient, friendly. Totally flexible and no complaining in spite of a complicated move that involved moving an awkward couch down three flights of stairs and an awkward set-up for delivering to the second location. (Sorry, guys.) Definitely would recommend with no reservations. Great company."
    },
    {
        "key": 35,
        "author": "Conor Tubbs",
        "quote": "There's very little that is as stressful as moving. With all of the packing and paperwork, every task is more exhausting than the last. I couldn't be happier that I called Local Muscle to do the heavy lifting. We needed a quick exit, and one of our roommates was backpacking in New Zealand. They worked with us to make sure his things were taken care of with ease and professionalism. Dylan and Zach really cut down the stress and made it easy for us."
    },
    {
        "key": 36,
        "author": "Circe Moss MacDonald",
        "quote": "Tim and Matt are my heroes!  They were super friendly and easy to work with, even after I blew the start-time; we were late, but they were sitting patiently, waiting here for us.  Who knew a trailer full of our stuff could be emptied in a little more than two hours?!?  They were kind to my 6 year-old who was scampering underfoot, too.  Best idea I've had to hire these guys.  Thank you to Maura and Brandon, too, who set the whole thing up for us on the back end; I was admittedly an anxious, high-maintenance client, and they cheerfully answered all my questions and were super flexible with my last-minute changes.  Best money I've spent, no question."
    },
    {
        "key": 37,
        "author": "Donovan White",
        "quote": "We recently moved from Falmouth to Limerick. From the great communication with Chris who was the estimator to the timeliness and professionalism of the moving crew I am so very pleased. This crew was careful, conscientious, and also very efficient. It was not uncommon to see the Ashton or Dan running back and forth between the moving truck and the house. They even went so far as to create a suspension hanger for my Kayak and Paddleboard which were all moved with expert efficiency. I highly recommend this awesome team, and also found their rates extremely reasonable."
    },
    {
        "key": 38,
        "author": "Susan Stern",
        "quote": "Local Muscle  Mivers Michael and Zach were wonderful!  They had the daunting task of moving my bed up a ladder through a window and did it well! They were friendly and courteous! Best moving company ever and I've moved alot! Would never use anyone else!! Thank you, Michael and Zach!!!"
    },
    {
        "key": 39,
        "author": "Jenny D.",
        "quote": "I had an incredible experience with a team of three on Monday morning for an apartment to apartment in the same building move. First, Nicole called to inform me that the team was here and on time. Boom. Points awarded for timeliness. Then, she was friendly, approachable, and professional as we went over the logistics of the move and the inventory.  Boomity boom. Points for having her sh*t together. Then Carl, Nicole, and Nice Guy (whose name I shamefully have forgotten) took every single item  carefully out of my place and staged it for the multipoint move using the elevator and the lobby. Boomity boomity boom. Points for efficiency and care! Then, the Dream Team thoughtfully placed all of my  stuff into the new apartment. And though it wasn't assembled when they moved it, they offered to help me rebuild my franken-bed because they had found the missing hardware I didn't think I had anymore! Boom shackalacka! Points for perfect customer service and going above and beyond what they had to do. Will I use Local Muscle again? You betcha. Yes, I recommend them. Timely, efficient, and careful..."
    },
    {
        "key": 40,
        "author": "Patrick E.",
        "quote": "Absolutly outstanding service from A to Z. Responsive, friendly and oh did they hustle hard. We had 2 trucks and 5 movers and without a fault they did they did a great job.  Final total was $2,000 less than other big companies. They charge by hour---not weight---a huge plus. A++++++"
    },
    {
        "key": 41,
        "author": "Vince K.",
        "quote": "I had a wonderful experience with local muscle movers. They moved both my personal home items as well as my business warehouse. It was impressive, they did a cross state move in 2 days. They picked up the items on Saturday morning and delivered them on Sunday morning. The crew was very professional. I would highly recommend them to anybody looking for a local or cross state move."
    }
]