[
    {
        "quote": "I moved from San Diego, CA to Bath, Maine. I was shipping most of my items in shipping pods through Big Box company. I was looking for a local mover to move my items from the shipping facility where my boxes would be delivered near Portland to my home in Bath. The box company tried to help us find someone, but we only got two outrageous quotes. So I started google local movers and Local Muscle Movers camp up along with about a dozen or so others. Out of all of the inquiries I sent, Local Muscle Movers responded promptly and worked with me on getting an electronic quote over. The wrench in my situation is that I did not know exactly when my boxes would arrive at the shipping facility. The Box company said 10-14 business days. Long story short because of the ineptitude of the box company we had to reschedule Local Muscle a few times. They were flexible, always responsive, and made our move work. Not only that, they were fast, efficient and took pictures and noted damaged items as they unloaded the boxes. They were extremely professional with every hiccup that happened with our move. I cannot recommend them enough.",
        "author": "Jaymie Levan",
        "key": 0
    },
    {
        "quote": "I'm so glad Local Muscle was recommended to me when I was preparing for my move. It was a breeze to book them and all my many questions were answered by the folks in the office. On moving day Chris, Max, Charlie, and Soren were all simply wonderful. They treated my belongings with care and were friendly, considerate, and efficient. Moving is always so stressful but these guys made it a very pleasant experience! Local Muscle should be proud to have them.",
        "author": "Tobin Moore",
        "key": 1
    },
    {
        "quote": "Highly recommend Local Muscle. The movers showed up on time, were very friendly while being efficient. They dealt with the parking permits, which was a relief since both locations were tough parking situations. They asked me where I wanted the furniture and take really good care of antique furniture that I care a lot about. Love that it is a local company involved in the arts community too! I was slightly hesitant because it was in the high/mid-range of price quotes I received, but I went with them because of the good reviews. Really glad I did because the price ended up being the lowest estimated cost -- over all great experience so I wanted to make sure I left a review! They were also very COVID-conscious and wore masks the whole time, which I appreciated!",
        "author": "Melanie Dorn",
        "key": 2
    },
    {
        "quote": "GREAT! these guys know what they are doing and do it very, very well. I thought the move would take most of the day but they packed up our house and delivered all contents without incident. Not only would I hire them again, but I would gladly tell all my friends about how great they are. I don't want to over again....but if I did, these would be the only movers I would use.",
        "author": "Anonymous Yelp Review",
        "key": 3
    },
    {
        "quote": "Had truck packed within one hour and delivered contents after a two hour ride to new location. All contents arrived safe and sound. Pat and Zack, great job👍",
        "author": "Anonymous Yelp Review",
        "key": 4
    },
    {
        "quote": "Highly recommend Local Muscle for all your moving needs! They were fantastic. My one bedroom with some heavy boxes was loaded up in under an hour and unloaded up 3 flights of stairs in just about the same time. Dan and the crew were personable, helpful, and covid compliant with masks on the entire time. Very happy I went with them! :)",
        "author": "Erin Bertoni",
        "key": 5
    },
    {
        "quote": "The folks at Local Muscle will give you the best service at the best price, hands down. I got quotes from a few local moving companies and found LM's prices to be similar or less than their competitors. Dan was professional and helpful through the planning process, and the two people that did the actual moving were courteous and careful with my items. Start to finish it was a great experience.",
        "author": "Elizabeth Whitmore",
        "key": 6
    },
    {
        "quote": "Local muscle helped us move our stuff from 1 home and storage unit to a new home and we had a great experience! They were responsive, punctual, worked very quickly, and did an overall great job. Highly recommend.",
        "author": "Marijana Mitrovic",
        "key": 7
    },
    {
        "quote": "I highly recommend Local Muscle Movers for your moving needs. Dan was great to deal with to provide us a quote for a move that happened with an extremely short lead time. I called on Monday to get a quote to move from our storage facility and we moved on Saturday of the same week. Not only were they fast and courteous but they very professional to work with. Chris & Ben were the movers that arrived within the arrival time window and were very easy to work with. They even moved a couple of larger items into our basement after we moved into our house and realized that the pieces were not right in the space that they were originally intended. Without hesitation they moved the pieces for us. I’m also very happy with the care that they took in carefully moving our belongings into a newly constructed home. They are now the first company that I will call if I need to move anything!",
        "author": "Michael S",
        "key": 8
    },
    {
        "quote": "Quick to respond with our quote, reasonably priced and the guys stayed busy the whole time they were on site. Thank you for taking the stress away from our move!",
        "author": "Alix Olcott",
        "key": 9
    },
    {
        "quote": "I have used local muscle now 3 times for various types of moves and each time I am impressed with the speed and professionalism of the crew. I will continue to recommend this company to anyone who is moving because once you use these guys you’ll never want to try to get a couch down a set of stairs yourself again!",
        "author": "Abby Jordan",
        "key": 10
    },
    {
        "quote": "I moved last month, and hired Local Muscle to help with all of the largest items. The estimate form is very thorough, they made sure to understand exactly what needed to be moved and do most planning before they arrived. They arrived on time with all of the information on file and made a plan with myself and my partner about how to proceed. The movers were polite, efficient, careful, and personable. They safely moved all of the items on my list, plus a few extra in less than the original estimated time.  I was extremely pleased with the service and do recommend them for anyone moving near Portland.",
        "author": "Cera Catron",
        "key": 11
    }
]