[
    {
        "quote": "I moved from San Diego, CA to Bath, Maine. I was shipping most of my items in shipping pods through Big Box company. I was looking for a local mover to move my items from the shipping facility where my boxes would be delivered near Portland to my home in Bath. The box company tried to help us find someone, but we only got two outrageous quotes. So I started google local movers and Local Muscle Movers camp up along with about a dozen or so others. Out of all of the inquiries I sent, Local Muscle Movers responded promptly and worked with me on getting an electronic quote over. The wrench in my situation is that I did not know exactly when my boxes would arrive at the shipping facility. The Box company said 10-14 business days. Long story short because of the ineptitude of the box company we had to reschedule Local Muscle a few times. They were flexible, always responsive, and made our move work. Not only that, they were fast, efficient and took pictures and noted damaged items as they unloaded the boxes. They were extremely professional with every hiccup that happened with our move. I cannot recommend them enough.",
        "author": "Jaymie Levan",
        "key": 0
    },
    {
        "quote": "I'm so glad Local Muscle was recommended to me when I was preparing for my move. It was a breeze to book them and all my many questions were answered by the folks in the office. On moving day Chris, Max, Charlie, and Soren were all simply wonderful. They treated my belongings with care and were friendly, considerate, and efficient. Moving is always so stressful but these guys made it a very pleasant experience! Local Muscle should be proud to have them.",
        "author": "Tobin Moore",
        "key": 1
    },
    {
        "quote": "Highly recommend Local Muscle. The movers showed up on time, were very friendly while being efficient. They dealt with the parking permits, which was a relief since both locations were tough parking situations. They asked me where I wanted the furniture and take really good care of antique furniture that I care a lot about. Love that it is a local company involved in the arts community too! I was slightly hesitant because it was in the high/mid-range of price quotes I received, but I went with them because of the good reviews. Really glad I did because the price ended up being the lowest estimated cost -- over all great experience so I wanted to make sure I left a review! They were also very COVID-conscious and wore masks the whole time, which I appreciated!",
        "author": "Melanie Dorn",
        "key": 2
    }
]